Housing Market
Introduction:
This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

# Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

# Step 2. Create 3 differents Series, each of length 100, as follows:

The first a random number from 1 to 4
The second a random number from 1 to 3
The third a random number from 10,000 to 30,000

In [21]:
data1 = pd.Series(np.random.randint(1,5,100), dtype='l')
data2 = pd.Series(np.random.randint(1,4,100), dtype='l')
data3 = pd.Series(np.random.randint(10000,30001,100), dtype='l')

# Step 3. Let's create a DataFrame by joinning the Series by column

In [24]:
df = pd.DataFrame([data1, data2, data3])
df

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,1,1,1,2,4,4,4,3,4,4,...,4,3,3,4,1,1,2,3,4,3
1,2,2,2,2,2,2,2,1,1,3,...,3,3,1,3,2,3,1,1,3,3
2,17543,24775,23725,11036,12710,25615,15661,24207,28059,14133,...,23110,19826,13872,17947,29372,24790,17445,20966,23338,20638

In [25]:
df = df.T
df

    0  1      2
0   1  2  17543
1   1  2  24775
2   1  2  23725
3   2  2  11036
4   4  2  12710
.. .. ..    ...
95  1  3  24790
96  2  1  17445
97  3  1  20966
98  4  3  23338
99  3  3  20638

[100 rows x 3 columns]

다른 풀이

In [27]:

s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  3  12477
1  4  1  27039
2  4  3  11439
3  2  2  26250
4  2  2  15825

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.columns

Index(['bedrs', 'bathrs', 'price_sqr_meter'], dtype='object')

다른풀이

In [28]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       3            12477
1      4       1            27039
2      4       3            11439
3      2       2            26250
4      2       2            15825

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [29]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       4
2       4
3       2
4       2
..    ...
95  13145
96  10642
97  24798
98  27684
99  28328

[300 rows x 1 columns]

In [ ]:
bigcolumn = pd*

# Step 6. Ops it seems it is going only until index 99. Is it true?

In [30]:
len(bigcolumn)

300

In [31]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

In [33]:
bigcolumn.index.is_unique

False

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [34]:
bigcolumn.reset_index(drop=True, inplace=True)

In [35]:
bigcolumn

         0
0        1
1        4
2        4
3        2
4        2
..     ...
295  13145
296  10642
297  24798
298  27684
299  28328

[300 rows x 1 columns]